In [1]:
# let us import the Pandas Library
import pandas as pd

#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [2]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [3]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [4]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [5]:
# Access the value on the first row and the first column
print(df.iloc[0, 0])
print(df.iloc[0, 2])

# Access the column using the name
df.loc[0, 'Salary']

Rose
Architect Group

100000

In [8]:
#Let us create a new dataframe called 'df2' and assign 'df' to it. Now, let us set the "Name" column as an index column using the method set_index().
df2=df
df2=df2.set_index("Name")

#To display the first 5 rows of new dataframe
print (df2.head())

#Now, let us access the column using the name
print (df2.loc['Jane', 'Salary'])

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000
50000

In [9]:
# Slicing
print (df.iloc[0:2, 0:3])
print (df.loc[0:2,'ID':'Department'])

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group
   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team